1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ПараметрыОтрузки</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗаявкиНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>оставил как служебный реквизит для префиксации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыОтгрузкиГотовойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаНаОснованииЗаданияНаСписаниеГП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Comment>Для склада лк Металлострой ГП - Ликофлекс, для склада ИКС ГП - ИксПак</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ШаблоныЗаявокНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаИзЗаказаСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаЦены</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_СчетНаОплатуКлиенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКомплекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузкаВРублях</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Втулка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГруппировки</Name>
							<Comment>имеет смысл, когда комплект состоит из позиций с разным количеством (несколько позиций формируют собой "подкомплекты")</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеальныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузитьВсе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДляДоступаСлужебная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//		КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//Представление = Прав(Данные.Номер, 6);
	
КонецПроцедуры
 
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//Поля.Добавить("Номер");
	
КонецПроцедуры

//Функция ПолучитьТекстЗапросаДляДереваОстаткиСтар20210415(СтрокаСортировки = "", ИспользоватьАдресноеХранение) экспорт
//	
//	Если ИспользоватьАдресноеХранение Тогда
//		// Будем искать по ячеистому складу и с сериями 
//		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		               |	Остатки.Номенклатура КАК Номенклатура,
//		               |	Остатки.Характеристика КАК Характеристика,
//		               |	Остатки.Серия.Лико_НаправлениеНамотки КАК Намотка,
//		               |	Остатки.Серия.Лико_НомерПоставки КАК НомерПоставки,
//		               |	Остатки.Серия.Лико_Втулка КАК Втулка,
//		               |	Остатки.Серия.Лико_Город КАК Город,
//		               |	Остатки.Серия.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
//		               |	Остатки.Серия.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
//		               |	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
//		               |	ЗаказКлиента.Дата КАК Дата,
//		               |	ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
//		               |	ЗаказКлиента.Контрагент КАК Контрагент,
//		               |	ВЫБОР
//		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
//		               |			ТОГДА ЗаказКлиента.Валюта
//		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
//		               |	КОНЕЦ КАК ВалютаЦены,
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)) КАК АдресДоставки,
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)) КАК АдресДоставкиЗначенияПолей,
//		               |	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
//		               |	СУММА(Остатки.ВНаличииОстаток) КАК Количество,
//		               |	Остатки.Номенклатура.Наименование КАК ПредставлениеНоменклатуры
//		               |ПОМЕСТИТЬ ВТПартииОстатки
//		               |ИЗ
//		               |	РегистрНакопления.ТоварыВЯчейках.Остатки(
//		               |			,
//		               |			ВЫБОР
//		               |					КОГДА &ОтборПоСкладуУстановлен
//		               |						ТОГДА Ячейка.Владелец В (&Склады)
//		               |					ИНАЧЕ ИСТИНА
//		               |				КОНЕЦ
//		               |				И ВЫБОР
//		               |					КОГДА &Партнер = НЕОПРЕДЕЛЕНО
//		               |						ТОГДА ИСТИНА
//		               |					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Партнер = &Партнер
//		               |				КОНЕЦ
//		               |				И ВЫБОР
//		               |					КОГДА &Менеджер = НЕОПРЕДЕЛЕНО
//		               |						ТОГДА ИСТИНА
//		               |					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Менеджер = &Менеджер
//		               |				КОНЕЦ
//		               |				И ВЫБОР
//		               |					КОГДА &ОтборПоЗаказам
//		               |						ТОГДА Характеристика.Лико_ЗаказНоменклатуры В (&МассивЗаказов)
//		               |					ИНАЧЕ ИСТИНА
//		               |				КОНЕЦ
//		               |				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
//		               |				И НЕ Ячейка В (&ЯчейкаРастарка)) КАК Остатки
//		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
//		               |		ПО Остатки.Характеристика.Лико_ЗаказНоменклатуры = ЗаказКлиента.Ссылка
//		               |ГДЕ
//		               |	Остатки.ВНаличииОстаток > 0
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	Остатки.Номенклатура,
//		               |	Остатки.Характеристика,
//		               |	Остатки.Серия.Лико_Втулка,
//		               |	Остатки.Серия.Лико_КодЭтикеткиЗаказчика,
//		               |	Остатки.Серия.Лико_ЧестныйЗнак,
//		               |	ЗаказКлиента.Ссылка,
//		               |	Остатки.Серия.Лико_НаправлениеНамотки,
//		               |	Остатки.Серия.Лико_НомерПоставки,
//		               |	Остатки.Серия.Лико_Город,
//		               |	ЗаказКлиента.Дата,
//		               |	ЗаказКлиента.НомерБезПрефикса,
//		               |	ЗаказКлиента.Контрагент,
//		               |	ВЫБОР
//		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
//		               |			ТОГДА ЗаказКлиента.Валюта
//		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
//		               |	КОНЕЦ,
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)),
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)),
//		               |	ЗаказКлиента.Грузополучатель,
//		               |	Остатки.Номенклатура.Наименование
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	ВТПартииОстатки.Номенклатура КАК Номенклатура,
//		               |	ВТПартииОстатки.Характеристика КАК Характеристика,
//		               |	ВТПартииОстатки.Намотка КАК Намотка,
//		               |	ВТПартииОстатки.НомерПоставки КАК НомерПоставки,
//		               |	ВТПартииОстатки.Втулка КАК Втулка,
//		               |	ВТПартииОстатки.Город КАК Город,
//		               |	ВТПартииОстатки.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
//		               |	ВТПартииОстатки.ЧестныйЗнак КАК ЧестныйЗнак,
//		               |	ВТПартииОстатки.ЗаказКлиента КАК ЗаказКлиента,
//		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС КАК ЦенаДляДокументовВключаетНДС,
//		               |	ВТПартииОстатки.Дата КАК Дата,
//		               |	ВТПартииОстатки.НомерЗаказа КАК НомерЗаказа,
//		               |	ВТПартииОстатки.Контрагент КАК Контрагент,
//		               |	ВТПартииОстатки.ВалютаЦены КАК ВалютаЦены,
//		               |	ВТПартииОстатки.АдресДоставки КАК АдресДоставки,
//		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
//		               |	ВТПартииОстатки.Грузополучатель КАК Грузополучатель,
//		               |	ВТПартииОстатки.Количество КАК Количество,
//		               |	МАКСИМУМ(ВЫБОР
//		               |			КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
//		               |				ТОГДА ЗаказКлиентаТовары.Цена * ВЫБОР
//		               |						КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
//		               |							ТОГДА 1
//		               |						ИНАЧЕ 100 / (100 + ЗаказКлиентаТовары.СтавкаНДС.Ставка)
//		               |					КОНЕЦ
//		               |			ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
//		               |		КОНЕЦ) КАК Цена,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.СтавкаНДС) КАК СтавкаНДС,
//		               |	ВТПартииОстатки.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
//		               |ИЗ
//		               |	ВТПартииОстатки КАК ВТПартииОстатки
//		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		               |		ПО ВТПартииОстатки.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
//		               |			И ВТПартииОстатки.Номенклатура = ЗаказКлиентаТовары.Номенклатура
//		               |			И ВТПартииОстатки.Характеристика = ЗаказКлиентаТовары.Характеристика
//		               |			И ВТПартииОстатки.Намотка = ЗаказКлиентаТовары.Направление
//		               |			И ВТПартииОстатки.НомерПоставки = ЗаказКлиентаТовары.NКонтракта
//		               |			И ВТПартииОстатки.Город = ЗаказКлиентаТовары.Город
//		               |			И ВТПартииОстатки.КодЭтикеткиЗаказчика = ЗаказКлиентаТовары.КодЭтикеткиЗаказчика
//		               |			И ВТПартииОстатки.ЧестныйЗнак = ЗаказКлиентаТовары.ЧестныйЗнак
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей,
//		               |	ВТПартииОстатки.Характеристика,
//		               |	ВТПартииОстатки.Втулка,
//		               |	ВТПартииОстатки.КодЭтикеткиЗаказчика,
//		               |	ВТПартииОстатки.ЧестныйЗнак,
//		               |	ВТПартииОстатки.НомерЗаказа,
//		               |	ВТПартииОстатки.Контрагент,
//		               |	ВТПартииОстатки.НомерПоставки,
//		               |	ВТПартииОстатки.Намотка,
//		               |	ВТПартииОстатки.АдресДоставки,
//		               |	ВТПартииОстатки.Дата,
//		               |	ВТПартииОстатки.Грузополучатель,
//		               |	ВТПартииОстатки.ВалютаЦены,
//		               |	ВТПартииОстатки.Номенклатура,
//		               |	ВТПартииОстатки.ЗаказКлиента,
//		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС,
//		               |	ВТПартииОстатки.Город,
//		               |	ВТПартииОстатки.Количество,
//		               |	ВТПартииОстатки.ПредставлениеНоменклатуры";
//	Иначе
//		// Будем искать по ТоварыНаСкладах без серий 
//		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		               |	Остатки.Номенклатура КАК Номенклатура,
//		               |	Остатки.Характеристика КАК Характеристика,
//		               |	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
//		               |	ЗаказКлиента.Дата КАК Дата,
//		               |	ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
//		               |	ЗаказКлиента.Контрагент КАК Контрагент,
//		               |	ВЫБОР
//		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
//		               |			ТОГДА ЗаказКлиента.Валюта
//		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
//		               |	КОНЕЦ КАК ВалютаЦены,
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)) КАК АдресДоставки,
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)) КАК АдресДоставкиЗначенияПолей,
//		               |	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
//		               |	СУММА(Остатки.ВНаличииОстаток) КАК Количество,
//		               |	Остатки.Номенклатура.Наименование КАК ПредставлениеНоменклатуры
//		               |ПОМЕСТИТЬ ВТПартииОстатки
//		               |ИЗ
//		               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
//		               |			,
//		               |			ВЫБОР
//		               |					КОГДА &ОтборПоСкладуУстановлен
//		               |						ТОГДА Склад В (&Склады)
//		               |					ИНАЧЕ ИСТИНА
//		               |				КОНЕЦ
//		               |				И ВЫБОР
//		               |					КОГДА &Партнер = НЕОПРЕДЕЛЕНО
//		               |						ТОГДА ИСТИНА
//		               |					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Партнер = &Партнер
//		               |				КОНЕЦ
//		               |				И ВЫБОР
//		               |					КОГДА &ОтборПоЗаказам
//		               |						ТОГДА Характеристика.Лико_ЗаказНоменклатуры В (&МассивЗаказов)
//		               |					ИНАЧЕ ИСТИНА
//		               |				КОНЕЦ
//		               |				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток) КАК Остатки
//		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
//		               |		ПО Остатки.Характеристика.Лико_ЗаказНоменклатуры = ЗаказКлиента.Ссылка
//		               |ГДЕ
//		               |	Остатки.ВНаличииОстаток > 0
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	Остатки.Номенклатура,
//		               |	Остатки.Характеристика,
//		               |	ЗаказКлиента.Ссылка,
//		               |	ЗаказКлиента.Дата,
//		               |	ЗаказКлиента.НомерБезПрефикса,
//		               |	ЗаказКлиента.Контрагент,
//		               |	ВЫБОР
//		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
//		               |			ТОГДА ЗаказКлиента.Валюта
//		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
//		               |	КОНЕЦ,
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)),
//		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)),
//		               |	ЗаказКлиента.Грузополучатель,
//		               |	Остатки.Номенклатура.Наименование
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	ВТПартииОстатки.Номенклатура КАК Номенклатура,
//		               |	ВТПартииОстатки.Характеристика КАК Характеристика,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.Направление) КАК Намотка,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК НомерПоставки,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.ВнутреннийДиаметр) КАК Втулка,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.Город) КАК Город,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.ЧестныйЗнак) КАК ЧестныйЗнак,
//		               |	ВТПартииОстатки.ЗаказКлиента КАК ЗаказКлиента,
//		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС КАК ЦенаДляДокументовВключаетНДС,
//		               |	ВТПартииОстатки.Дата КАК Дата,
//		               |	ВТПартииОстатки.НомерЗаказа КАК НомерЗаказа,
//		               |	ВТПартииОстатки.Контрагент КАК Контрагент,
//		               |	ВТПартииОстатки.ВалютаЦены КАК ВалютаЦены,
//		               |	ВТПартииОстатки.АдресДоставки КАК АдресДоставки,
//		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
//		               |	ВТПартииОстатки.Грузополучатель КАК Грузополучатель,
//		               |	ВТПартииОстатки.Количество КАК Количество,
//		               |	МАКСИМУМ(ВЫБОР
//		               |			КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
//		               |				ТОГДА ЗаказКлиентаТовары.Цена * ВЫБОР
//		               |						КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
//		               |							ТОГДА 1
//		               |						ИНАЧЕ 100 / (100 + ЗаказКлиентаТовары.СтавкаНДС.Ставка)
//		               |					КОНЕЦ
//		               |			ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
//		               |		КОНЕЦ) КАК Цена,
//		               |	МАКСИМУМ(ЗаказКлиентаТовары.СтавкаНДС) КАК СтавкаНДС,
//		               |	ВТПартииОстатки.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
//		               |ИЗ
//		               |	ВТПартииОстатки КАК ВТПартииОстатки
//		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		               |		ПО ВТПартииОстатки.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
//		               |			И ВТПартииОстатки.Номенклатура = ЗаказКлиентаТовары.Номенклатура
//		               |			И ВТПартииОстатки.Характеристика = ЗаказКлиентаТовары.Характеристика
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей,
//		               |	ВТПартииОстатки.Характеристика,
//		               |	ВТПартииОстатки.НомерЗаказа,
//		               |	ВТПартииОстатки.Контрагент,
//		               |	ВТПартииОстатки.АдресДоставки,
//		               |	ВТПартииОстатки.Дата,
//		               |	ВТПартииОстатки.Грузополучатель,
//		               |	ВТПартииОстатки.ВалютаЦены,
//		               |	ВТПартииОстатки.Номенклатура,
//		               |	ВТПартииОстатки.ЗаказКлиента,
//		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС,
//		               |	ВТПартииОстатки.Количество,
//		               |	ВТПартииОстатки.ПредставлениеНоменклатуры";
//	КонецЕсли;
//	
//	Если СтрокаСортировки <> "" Тогда
//		ТекстЗапроса = ТекстЗапроса + "
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//				   |" + СтрокаСортировки;
//	КонецЕсли;
//					 
//	Возврат ТекстЗапроса;
//	
//КонецФункции

Функция ПолучитьТекстЗапросаДляДереваОстатки(СтрокаСортировки = "", ИспользоватьАдресноеХранение) экспорт
	
	Если ИспользоватьАдресноеХранение Тогда
		// Будем искать по ячеистому складу и с сериями 
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Остатки.Номенклатура КАК Номенклатура,
		               |	Остатки.Характеристика КАК Характеристика,
		               |	Остатки.Серия.Лико_НаправлениеНамотки КАК Намотка,
		               |	Остатки.Серия.Лико_НомерПоставки КАК НомерПоставки,
		               |	Остатки.Серия.Лико_Втулка КАК Втулка,
		               |	Остатки.Серия.Лико_Город КАК Город,
		               |	Остатки.Серия.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		               |	Остатки.Серия.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
		               |	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
		               |	ЗаказКлиента.Дата КАК Дата,
		               |	ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
		               |	ЗаказКлиента.Контрагент КАК Контрагент,
		               |	ВЫБОР
		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		               |			ТОГДА ЗаказКлиента.Валюта
		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
		               |	КОНЕЦ КАК ВалютаЦены,
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)) КАК АдресДоставки,
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)) КАК АдресДоставкиЗначенияПолей,
		               |	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
		               |	СУММА(Остатки.ВНаличииОстаток) КАК Количество,
		               |	Остатки.Номенклатура.Наименование КАК ПредставлениеНоменклатуры
		               |ПОМЕСТИТЬ ВТПартииОстатки
		               |ИЗ
		               |	РегистрНакопления.ТоварыВЯчейках.Остатки(
		               |			,
		               |			ВЫБОР
		               |					КОГДА &ОтборПоСкладуУстановлен
		               |						ТОГДА Ячейка.Владелец В (&Склады)
		               |					ИНАЧЕ ИСТИНА
		               |				КОНЕЦ
		               |				И ВЫБОР
		               |					КОГДА &Партнер = НЕОПРЕДЕЛЕНО
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Партнер = &Партнер
		               |				КОНЕЦ
		               |				И ВЫБОР
		               |					КОГДА &Менеджер = НЕОПРЕДЕЛЕНО
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Менеджер = &Менеджер
		               |				КОНЕЦ
		               |				И ВЫБОР
		               |					КОГДА &ОтборПоЗаказам
		               |						ТОГДА Характеристика.Лико_ЗаказНоменклатуры В (&МассивЗаказов)
		               |					ИНАЧЕ ИСТИНА
		               |				КОНЕЦ
		               |				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
		               |				И НЕ Ячейка В (&ЯчейкаРастарка)) КАК Остатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		               |		ПО Остатки.Характеристика.Лико_ЗаказНоменклатуры = ЗаказКлиента.Ссылка
		               |ГДЕ
		               |	Остатки.ВНаличииОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Остатки.Номенклатура,
		               |	Остатки.Характеристика,
		               |	Остатки.Серия.Лико_Втулка,
		               |	Остатки.Серия.Лико_КодЭтикеткиЗаказчика,
		               |	Остатки.Серия.Лико_ЧестныйЗнак,
		               |	ЗаказКлиента.Ссылка,
		               |	Остатки.Серия.Лико_НаправлениеНамотки,
		               |	Остатки.Серия.Лико_НомерПоставки,
		               |	Остатки.Серия.Лико_Город,
		               |	ЗаказКлиента.Дата,
		               |	ЗаказКлиента.НомерБезПрефикса,
		               |	ЗаказКлиента.Контрагент,
		               |	ВЫБОР
		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		               |			ТОГДА ЗаказКлиента.Валюта
		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
		               |	КОНЕЦ,
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)),
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)),
		               |	ЗаказКлиента.Грузополучатель,
		               |	Остатки.Номенклатура.Наименование
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВТПартииОстатки.Номенклатура КАК Номенклатура,
		               |	ВТПартииОстатки.Характеристика КАК Характеристика,
		               |	ВТПартииОстатки.Намотка КАК Намотка,
		               |	ВТПартииОстатки.НомерПоставки КАК НомерПоставки,
		               |	ВТПартииОстатки.Втулка КАК Втулка,
		               |	ВТПартииОстатки.Город КАК Город,
		               |	ВТПартииОстатки.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		               |	ВТПартииОстатки.ЧестныйЗнак КАК ЧестныйЗнак,
		               |	ВТПартииОстатки.ЗаказКлиента КАК ЗаказКлиента,
		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС КАК ЦенаДляДокументовВключаетНДС,
		               |	ВТПартииОстатки.Дата КАК Дата,
		               |	ВТПартииОстатки.НомерЗаказа КАК НомерЗаказа,
		               |	ВТПартииОстатки.Контрагент КАК Контрагент,
		               |	ВТПартииОстатки.ВалютаЦены КАК ВалютаЦены,
		               |	ВТПартииОстатки.АдресДоставки КАК АдресДоставки,
		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
		               |	ВТПартииОстатки.Грузополучатель КАК Грузополучатель,
		               |	ВТПартииОстатки.Количество КАК Количество,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.ЦенаДляДокументов) КАК ЦенаДляДокументов,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.Цена) КАК Цена,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.СтавкаНДС) КАК СтавкаНДС,
		               |	ВТПартииОстатки.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		               |ПОМЕСТИТЬ ВТ_СвязьПоВсемКлючевымПараметрам
		               |ИЗ
		               |	ВТПартииОстатки КАК ВТПартииОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		               |		ПО ВТПартииОстатки.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
		               |			И ВТПартииОстатки.Номенклатура = ЗаказКлиентаТовары.Номенклатура
		               |			И ВТПартииОстатки.Характеристика = ЗаказКлиентаТовары.Характеристика
		               |			И ВТПартииОстатки.Намотка = ЗаказКлиентаТовары.Направление
		               |			И ВТПартииОстатки.НомерПоставки = ЗаказКлиентаТовары.NКонтракта
		               |			И ВТПартииОстатки.Город = ЗаказКлиентаТовары.Город
		               |			И ВТПартииОстатки.КодЭтикеткиЗаказчика = ЗаказКлиентаТовары.КодЭтикеткиЗаказчика
		               |			И ВТПартииОстатки.ЧестныйЗнак = ЗаказКлиентаТовары.ЧестныйЗнак
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей,
		               |	ВТПартииОстатки.Характеристика,
		               |	ВТПартииОстатки.Втулка,
		               |	ВТПартииОстатки.КодЭтикеткиЗаказчика,
		               |	ВТПартииОстатки.ЧестныйЗнак,
		               |	ВТПартииОстатки.НомерЗаказа,
		               |	ВТПартииОстатки.Контрагент,
		               |	ВТПартииОстатки.НомерПоставки,
		               |	ВТПартииОстатки.Намотка,
		               |	ВТПартииОстатки.АдресДоставки,
		               |	ВТПартииОстатки.Дата,
		               |	ВТПартииОстатки.Грузополучатель,
		               |	ВТПартииОстатки.ВалютаЦены,
		               |	ВТПартииОстатки.Номенклатура,
		               |	ВТПартииОстатки.ЗаказКлиента,
		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС,
		               |	ВТПартииОстатки.Город,
		               |	ВТПартииОстатки.Количество,
		               |	ВТПартииОстатки.ПредставлениеНоменклатуры
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Номенклатура КАК Номенклатура,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Характеристика КАК Характеристика,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Намотка КАК Намотка,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.НомерПоставки КАК НомерПоставки,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Втулка КАК Втулка,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Город КАК Город,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЧестныйЗнак КАК ЧестныйЗнак,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЗаказКлиента КАК ЗаказКлиента,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЦенаДляДокументовВключаетНДС КАК ЦенаДляДокументовВключаетНДС,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Дата КАК Дата,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.НомерЗаказа КАК НомерЗаказа,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Контрагент КАК Контрагент,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ВалютаЦены КАК ВалютаЦены,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.АдресДоставки КАК АдресДоставки,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Грузополучатель КАК Грузополучатель,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Количество КАК Количество,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЦенаДляДокументов КАК ЦенаДляДокументов,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Цена КАК Цена,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.СтавкаНДС КАК СтавкаНДС,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЕслиНеНайденаЦенаТоСвязьПоХарактеристике
		               |ИЗ
		               |	ВТ_СвязьПоВсемКлючевымПараметрам КАК ВТ_СвязьПоВсемКлючевымПараметрам
		               |ГДЕ
		               |	НЕ ВТ_СвязьПоВсемКлючевымПараметрам.Цена ЕСТЬ NULL
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Номенклатура,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Характеристика,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Намотка,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.НомерПоставки,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Втулка,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Город,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.КодЭтикеткиЗаказчика,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЧестныйЗнак,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЗаказКлиента,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЦенаДляДокументовВключаетНДС,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Дата,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.НомерЗаказа,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Контрагент,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ВалютаЦены,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.АдресДоставки,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.АдресДоставкиЗначенияПолей,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Грузополучатель,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Количество,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.ЦенаДляДокументов),
		               |	МАКСИМУМ(ЗаказКлиентаТовары.Цена),
		               |	МАКСИМУМ(ЗаказКлиентаТовары.СтавкаНДС),
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ПредставлениеНоменклатуры
		               |ИЗ
		               |	ВТ_СвязьПоВсемКлючевымПараметрам КАК ВТ_СвязьПоВсемКлючевымПараметрам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		               |		ПО ВТ_СвязьПоВсемКлючевымПараметрам.Характеристика = ЗаказКлиентаТовары.Характеристика
		               |ГДЕ
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Цена ЕСТЬ NULL
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Номенклатура,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Характеристика,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Намотка,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.НомерПоставки,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Втулка,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Город,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.КодЭтикеткиЗаказчика,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЧестныйЗнак,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЗаказКлиента,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ЦенаДляДокументовВключаетНДС,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Дата,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.НомерЗаказа,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Контрагент,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ВалютаЦены,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.АдресДоставки,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.АдресДоставкиЗначенияПолей,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Грузополучатель,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.Количество,
		               |	ВТ_СвязьПоВсемКлючевымПараметрам.ПредставлениеНоменклатуры
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТПартииОстатки.Номенклатура КАК Номенклатура,
		               |	ВТПартииОстатки.Характеристика КАК Характеристика,
		               |	ВТПартииОстатки.Намотка КАК Намотка,
		               |	ВТПартииОстатки.НомерПоставки КАК НомерПоставки,
		               |	ВТПартииОстатки.Втулка КАК Втулка,
		               |	ВТПартииОстатки.Город КАК Город,
		               |	ВТПартииОстатки.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		               |	ВТПартииОстатки.ЧестныйЗнак КАК ЧестныйЗнак,
		               |	ВТПартииОстатки.ЗаказКлиента КАК ЗаказКлиента,
		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС КАК ЦенаДляДокументовВключаетНДС,
		               |	ВТПартииОстатки.ЗаказКлиента.Партнер КАК Партнер,
		               |	ВТПартииОстатки.Дата КАК Дата,
		               |	ВТПартииОстатки.НомерЗаказа КАК НомерЗаказа,
		               |	ВТПартииОстатки.Контрагент КАК Контрагент,
		               |	ВТПартииОстатки.ВалютаЦены КАК ВалютаЦены,
		               |	ВТПартииОстатки.АдресДоставки КАК АдресДоставки,
		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
		               |	ВТПартииОстатки.Грузополучатель КАК Грузополучатель,
		               |	ВТПартииОстатки.Количество КАК Количество,
		               |	ВЫБОР
		               |		КОГДА ВТПартииОстатки.ЦенаДляДокументов = 0
		               |			ТОГДА ВТПартииОстатки.Цена * ВЫБОР
		               |					КОГДА ВТПартииОстатки.ЦенаДляДокументовВключаетНДС
		               |						ТОГДА 1
		               |					ИНАЧЕ 100 / (100 + ВТПартииОстатки.СтавкаНДС.Ставка)
		               |				КОНЕЦ
		               |		ИНАЧЕ ВТПартииОстатки.ЦенаДляДокументов
		               |	КОНЕЦ КАК Цена,
		               |	ВТПартииОстатки.СтавкаНДС КАК СтавкаНДС,
		               |	ВТПартииОстатки.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		               |ИЗ
		               |	ВТ_ОбъединениеЕслиНеНайденаЦенаТоСвязьПоХарактеристике КАК ВТПартииОстатки";
	Иначе
		// Будем искать по ТоварыНаСкладах без серий 
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Остатки.Номенклатура КАК Номенклатура,
		               |	Остатки.Характеристика КАК Характеристика,
		               |	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
		               |	ЗаказКлиента.Дата КАК Дата,
		               |	ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
		               |	ЗаказКлиента.Контрагент КАК Контрагент,
		               |	ВЫБОР
		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		               |			ТОГДА ЗаказКлиента.Валюта
		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
		               |	КОНЕЦ КАК ВалютаЦены,
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)) КАК АдресДоставки,
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)) КАК АдресДоставкиЗначенияПолей,
		               |	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
		               |	СУММА(Остатки.ВНаличииОстаток) КАК Количество,
		               |	Остатки.Номенклатура.Наименование КАК ПредставлениеНоменклатуры
		               |ПОМЕСТИТЬ ВТПартииОстатки
		               |ИЗ
		               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
		               |			,
		               |			ВЫБОР
		               |					КОГДА &ОтборПоСкладуУстановлен
		               |						ТОГДА Склад В (&Склады)
		               |					ИНАЧЕ ИСТИНА
		               |				КОНЕЦ
		               |				И ВЫБОР
		               |					КОГДА &Партнер = НЕОПРЕДЕЛЕНО
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Партнер = &Партнер
		               |				КОНЕЦ
		               |				И ВЫБОР
		               |					КОГДА &ОтборПоЗаказам
		               |						ТОГДА Характеристика.Лико_ЗаказНоменклатуры В (&МассивЗаказов)
		               |					ИНАЧЕ ИСТИНА
		               |				КОНЕЦ
		               |				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток) КАК Остатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		               |		ПО Остатки.Характеристика.Лико_ЗаказНоменклатуры = ЗаказКлиента.Ссылка
		               |ГДЕ
		               |	Остатки.ВНаличииОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Остатки.Номенклатура,
		               |	Остатки.Характеристика,
		               |	ЗаказКлиента.Ссылка,
		               |	ЗаказКлиента.Дата,
		               |	ЗаказКлиента.НомерБезПрефикса,
		               |	ЗаказКлиента.Контрагент,
		               |	ВЫБОР
		               |		КОГДА ЗаказКлиента.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		               |			ТОГДА ЗаказКлиента.Валюта
		               |		ИНАЧЕ ЗаказКлиента.ВалютаДляДокументов
		               |	КОНЕЦ,
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставки КАК СТРОКА(1000)),
		               |	ВЫРАЗИТЬ(ЗаказКлиента.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)),
		               |	ЗаказКлиента.Грузополучатель,
		               |	Остатки.Номенклатура.Наименование
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВТПартииОстатки.Номенклатура КАК Номенклатура,
		               |	ВТПартииОстатки.Характеристика КАК Характеристика,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.Направление) КАК Намотка,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК НомерПоставки,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.ВнутреннийДиаметр) КАК Втулка,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.Город) КАК Город,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.ЧестныйЗнак) КАК ЧестныйЗнак,
		               |	ВТПартииОстатки.ЗаказКлиента КАК ЗаказКлиента,
		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС КАК ЦенаДляДокументовВключаетНДС,
		               |	ВТПартииОстатки.ЗаказКлиента.Партнер КАК Партнер,
		               |	ВТПартииОстатки.Дата КАК Дата,
		               |	ВТПартииОстатки.НомерЗаказа КАК НомерЗаказа,
		               |	ВТПартииОстатки.Контрагент КАК Контрагент,
		               |	ВТПартииОстатки.ВалютаЦены КАК ВалютаЦены,
		               |	ВТПартииОстатки.АдресДоставки КАК АдресДоставки,
		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
		               |	ВТПартииОстатки.Грузополучатель КАК Грузополучатель,
		               |	ВТПартииОстатки.Количество КАК Количество,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
		               |				ТОГДА ЗаказКлиентаТовары.Цена * ВЫБОР
		               |						КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
		               |							ТОГДА 1
		               |						ИНАЧЕ 100 / (100 + ЗаказКлиентаТовары.СтавкаНДС.Ставка)
		               |					КОНЕЦ
		               |			ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
		               |		КОНЕЦ) КАК Цена,
		               |	МАКСИМУМ(ЗаказКлиентаТовары.СтавкаНДС) КАК СтавкаНДС,
		               |	ВТПартииОстатки.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		               |ИЗ
		               |	ВТПартииОстатки КАК ВТПартииОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		               |		ПО ВТПартииОстатки.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
		               |			И ВТПартииОстатки.Номенклатура = ЗаказКлиентаТовары.Номенклатура
		               |			И ВТПартииОстатки.Характеристика = ЗаказКлиентаТовары.Характеристика
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТПартииОстатки.АдресДоставкиЗначенияПолей,
		               |	ВТПартииОстатки.Характеристика,
		               |	ВТПартииОстатки.НомерЗаказа,
		               |	ВТПартииОстатки.Контрагент,
		               |	ВТПартииОстатки.АдресДоставки,
		               |	ВТПартииОстатки.Дата,
		               |	ВТПартииОстатки.Грузополучатель,
		               |	ВТПартииОстатки.ВалютаЦены,
		               |	ВТПартииОстатки.Номенклатура,
		               |	ВТПартииОстатки.ЗаказКлиента,
		               |	ВТПартииОстатки.ЗаказКлиента.ЦенаДляДокументовВключаетНДС,
		               |	ВТПартииОстатки.ЗаказКлиента.Партнер,
		               |	ВТПартииОстатки.Количество,
		               |	ВТПартииОстатки.ПредставлениеНоменклатуры";
	КонецЕсли;
	
	Если СтрокаСортировки <> "" Тогда
		ТекстЗапроса = ТекстЗапроса + "
	               |
	               |УПОРЯДОЧИТЬ ПО
				   |" + СтрокаСортировки;
	КонецЕсли;
					 
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляДереваЗаказы(СтрокаСортировки) экспорт

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Направление КАК Намотка,
	|	ЗаказКлиентаТовары.NКонтракта КАК НомерПоставки,
	|	ЗаказКлиентаДок.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаДок.ЦенаДляДокументовВключаетНДС КАК ЦенаДляДокументовВключаетНДС,
	|	ЗаказКлиентаДок.Дата КАК Дата,
	|	ЗаказКлиентаДок.НомерБезПрефикса КАК НомерЗаказа,
	|	ЗаказКлиентаДок.Партнер КАК Партнер,
	|	ЗаказКлиентаТовары.Город КАК Город,
	|	ЗаказКлиентаТовары.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ЗаказКлиентаТовары.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ЗаказКлиентаДок.Контрагент КАК Контрагент,
	|	ЗаказКлиентаТовары.ВнутреннийДиаметр КАК Втулка,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ЗаказКлиентаТовары.Цена * ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА 1
	|					ИНАЧЕ 100 / (100 + ЗаказКлиентаТовары.СтавкаНДС.Ставка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаДок.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаДок.Валюта
	|		ИНАЧЕ ЗаказКлиентаДок.ВалютаДляДокументов
	|	КОНЕЦ КАК ВалютаЦены,
	|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	|	ВЫРАЗИТЬ(ЗаказКлиентаДок.АдресДоставки КАК СТРОКА(1000)) КАК АдресДоставки,
	|	ВЫРАЗИТЬ(ЗаказКлиентаДок.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)) КАК АдресДоставкиЗначенияПолей,
	|	ЗаказКлиентаДок.Грузополучатель КАК Грузополучатель,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ЗаказКлиентаТовары.Номенклатура.Наименование КАК СТРОКА(300)) КАК ПредставлениеНоменклатуры
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиентаДок.Ссылка
	|ГДЕ
	|	ЗаказКлиентаДок.Дата >= &Дата
	|	И ВЫБОР
	|			КОГДА &Партнер = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиентаДок.Партнер = &Партнер
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Менеджер = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиентаДок.Менеджер = &Менеджер
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборНеПоказыватьЗаказыВСостоянииСоздан
	//|				ТОГДА ЗаказКлиентаДок.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Создан)
	|				ТОГДА ЗаказКлиентаДок.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован) И ЗаказКлиентаДок.ДатаОтправкиВРаботу <> ДАТАВРЕМЯ(1,1,1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.Направление,
	|	ЗаказКлиентаТовары.NКонтракта,
	|	ЗаказКлиентаДок.Ссылка,
	|	ЗаказКлиентаДок.ЦенаДляДокументовВключаетНДС,
	|	ЗаказКлиентаДок.Дата,
	|	ЗаказКлиентаДок.НомерБезПрефикса,
	|	ЗаказКлиентаДок.Партнер,
	|	ЗаказКлиентаТовары.Город,
	|	ЗаказКлиентаТовары.КодЭтикеткиЗаказчика,
	|	ЗаказКлиентаТовары.ЧестныйЗнак,
	|	ЗаказКлиентаДок.Контрагент,
	|	ЗаказКлиентаТовары.ВнутреннийДиаметр,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ЗаказКлиентаТовары.Цена * ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА 1
	|					ИНАЧЕ 100 / (100 + ЗаказКлиентаТовары.СтавкаНДС.Ставка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаДок.ВалютаДляДокументов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаДок.Валюта
	|		ИНАЧЕ ЗаказКлиентаДок.ВалютаДляДокументов
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ЗаказКлиентаДок.АдресДоставкиЗначенияПолей КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ЗаказКлиентаДок.АдресДоставки КАК СТРОКА(1000)),
	|	ЗаказКлиентаТовары.СтавкаНДС,
	|	ЗаказКлиентаДок.Грузополучатель,
	|	ВЫРАЗИТЬ(ЗаказКлиентаТовары.Номенклатура.Наименование КАК СТРОКА(300))";

	Если СтрокаСортировки <> "" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|" + СтрокаСортировки;
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

Функция НайтиИлиСоздатьХарактеристикуДляУслуги(НоменклатураУслуга, Заказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
		|	И (ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.Номенклатура)) = &НоменклатураУслуга
		|	И ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("НоменклатураУслуга", НоменклатураУслуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		НоваяХарактеристика.Лико_ЗаказНоменклатуры = Заказ;
		НоваяХарактеристика.Владелец = НоменклатураУслуга;
		Попытка
			НоваяХарактеристика.Записать();
		Исключение
			Сообщить("Не удалось создать характеристику заказа """ + Заказ.НомерБезПрефикса + """ для услуги """ + НоменклатураУслуга + """! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
			Возврат Неопределено;	
		КонецПопытки;
		Возврат НоваяХарактеристика.Ссылка;			
	КонецЕсли;

КонецФункции

Процедура ЕстьЗаявкаНаОтгрузку(МассивЗаказов) Экспорт //+Лико m.shenderov 25.01.2022

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаДок.Ссылка КАК Заказ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Лико_ПараметрыОтрузки.ЗаказКлиента ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьЗаявкаНаОтгрузку,
	|	ЗаказКлиентаДок.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузкуЗаказ
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыОтрузки КАК Лико_ПараметрыОтрузки
	|		ПО ЗаказКлиентаДок.Ссылка = Лико_ПараметрыОтрузки.ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиентаДок.Ссылка В(&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаДок.Ссылка,
	|	ЗаказКлиентаДок.ЕстьЗаявкаНаОтгрузку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Заказ КАК Заказ,
	|	Вт.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузку,
	|	Вт.ЕстьЗаявкаНаОтгрузкуЗаказ КАК ЕстьЗаявкаНаОтгрузкуЗаказ
	|ИЗ
	|	Вт КАК Вт
	|ГДЕ
	|	Вт.ЕстьЗаявкаНаОтгрузку <> Вт.ЕстьЗаявкаНаОтгрузкуЗаказ";
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект=Выборка.Заказ.ПолучитьОбъект();
		ДокОбъект.ЕстьЗаявкаНаОтгрузку=Выборка.ЕстьЗаявкаНаОтгрузку;
		ДокОбъект.ОбменДанными.Загрузка=Истина;
		ДокОбъект.Записать();		
	КонецЦикла; 
	
КонецПроцедуры //-Лико m.shenderov 25.01.2022
